# а = 5 # а -> переменная

# Тип данных integer
# Операции:
# +

# a = 10
# b = 7
# result = a + b
# print(result)
# print() - функция для вывода в терминал

# Операции над типом данных int 
# + - сумма
# / - Деление с остатком
# // - Деление без остатка (Целочисленное деление)
# - - разность
# ** - Возведение в степень 
# * - умножение
# % - остаток от деления

# import math # (библиотека math)

# chislo_pi = math.pi
# print(chislo_pi)

#imort math
# from math import pi

# pow
# round
# divmod
# abs

# множественное присваивание
# a = 5
# a, b = 5, 6

# a = 10
# b = 11




a = 10
b = 11
a, b = b, a
print(a, b)